// // Задача 22: Напишите программу, которая принимает на вход число (N) 
// // и выдаёт таблицу квадратов чисел от 1 до N.
// // 5 -> 1, 4, 9, 16, 25.
// // 2 -> 1,4


// int N;
// while (!int.TryParse(Console.ReadLine(), out N) || N <= 0)
// {
//     Console.Write("Введено не целое число! Повторите попытку: ");
// }

// void PowTable(int N)
// {
//     int count = 1;
//     while (count <= N)
//     {
//     Console.Write(count * count + ", ");
//     count++;
//     }
// }


// PowTable(N);
var result = 1 / (double)7;

Console.WriteLine(result.ToString("0.###"));
